results/actix_heavy_20251009_071038/wrk_output.txt
Running 30s test @ http://127.0.0.1:8080/heavy
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   312.94ms  189.34ms   1.71s    96.21%
    Req/Sec    89.76     25.10   168.00     69.12%
  Latency Distribution
     50%  274.62ms
     75%  291.97ms
     90%  317.32ms
     99%    1.38s 
  10792 requests in 31.49s, 13.36GB read
Requests/sec:    342.72
Transfer/sec:    434.37MB